[
    {
        "name": "Philip Stockwell",
        "bio": "",
        "company": "Microsoft",
        "talk": "<p>The JavaScript language and tooling has progressed quickly over the last few years, but one thing still holds true, your end users are unlikely to have the same version as you. If you want to use the latest features and those still progressing through TC39 - such as async functions and decorators you'll have to compile.<\/p>\n<p>A compiler opens up the possibility of highly-productive development tools and practices, like static checking and code refactoring when developing JavaScript applications.<\/p>\n<p>We'll take a look at how Visual Studio Code and TypeScript improves your development whether you're working with existing JavaScript codebases or making the switch to TypeScript.<\/p>",
        "country": "UK",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/16",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973223,
        "_created": 1538577646,
        "_id": "5bb4d4ee6531339a5900004a",
        "image": {
            "path": "images\/phillip.png"
        },
        "title": "Productive Web Development with VS Code and TypeScript",
        "thumbnail": [],
        "order": 1,
        "event": "talk"
    },
    {
        "name": "Kyle Simpson & Dylan Schiemann",
        "bio": "<p class=\"copy\">Dylan Schiemann CEO of SitePen and co-founder of Dojo, Dylan Schiemann is an established presence in the JavaScript and open source communities. Under his direction, SitePen has become the definitive source for enterprise organizations that are focused on creating well-tested, highly performant and sustainable web applications. Dylan&rsquo;s current initiatives include guiding development on Intern, TypeScript and the anticipated launch of Dojo 2. Dylan was the co-founder of the Dojo Foundation prior to its merger with the jQuery Foundation to form the JS Foundation. When not actively engaged in bettering SitePen and demanding better developer tools, Dylan enjoys traveling and sharing his experience at conferences around the world.&nbsp;<br \/><br \/>Kyle Simpson is an evangelist of the open web, passionate about all things JavaScript. He writes books, teaches JavaScript, speaks, and contributes to the world of OSS.<\/p>",
        "company": "",
        "talk": "<p class=\"subtitle\">A highlight of CityJSConf is a debate on features and patterns of modern JavaScript, the future direction of the language, types, Functional Programming (FP), and more. JavaScript titans Kyle Simpson and Dylan Schiemann will discuss and code live, moderated by Luca Mezzalira and Simona Cotin.<\/p>\n<p class=\"copy\">One of the biggest strengths and weaknesses, pun intended, is the weakly typed nature of JavaScript. In this debate, we&rsquo;ll consider the value and benefits of adding development time type systems such as TypeScript vs. limitations they may impose.<\/p>\n<p class=\"copy\">&nbsp;<\/p>",
        "country": "US",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/25",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973217,
        "_created": 1538577826,
        "_id": "5bb4d5a26531339aee00001e",
        "image": {
            "path": "images\/debate.png"
        },
        "title": "The main event - TypeScript vs JavaScript",
        "thumbnail": [],
        "order": 2,
        "event": "talk"
    },
    {
        "name": "Alex Lakatos",
        "bio": "",
        "company": "Mozilla, Nexmo",
        "talk": "<p>We&rsquo;re entering a promising new era of computing. The advance of machine learning and artificial intelligence is reviving interest in conversational interfaces. This creates the potential for conversation as the new mode of interaction with technology.<\/p>\n<p>The big problem, recognizing spoken input has been mostly solved, but a new challenge has arisen: how to build a user experience that&rsquo;s modeled after natural human conversation.<\/p>\n<p>This talk outlines the basic mechanics of conversation, introduces core principles to design by, and presents you with a practical UI to start creating conversational experiences that engage, delight, and truly help your users.<\/p>\n<p>Alex Lakatos is a JavaScript Developer Advocate for Nexmo. In his spare time he is a Mozilla Tech Speaker and has been a contributor to the Mozilla project for the past six years, based in London. JavaScript developer building on the open web, he has been pushing its boundaries every day. You can check out his github profile or get in touch on twitter. When he&rsquo;s not programming, he likes to travel the world, so it&rsquo;s likely you&rsquo;ll bump into him in an airport lounge.<\/p>",
        "country": "Hungary\/Romania",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/23",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973297,
        "_created": 1538577956,
        "_id": "5bb4d6246531339b590003d9",
        "image": {
            "path": "images\/alexlakatos.png"
        },
        "title": "The era of Conversation",
        "thumbnail": [],
        "order": 3,
        "event": "talk"
    },
    {
        "name": "Pete Heard",
        "bio": "",
        "company": "Logicroom",
        "talk": "<p>We all want our apps to scale right? Then why do we face the same problems building JavaScript apps that we were facing over a decade ago using .net?<\/p>\n<p>We are told that the React architecture will somehow save us like the emperors new clothes, we throw in fancy add ons like Redux but eventually we always end up with a mess.<\/p>\n<p>Designing flexible software hasn&rsquo;t really changed. And by focussing on the frameworks it takes us away from the single most important thing; to separate the framework from our code!<\/p>\n<p>In this talk Pete will take you through a journey of building a modern mobile app using React Native and Redux. We will see how to apply the principles of Agile Craftsmanship to build a system of metaphorically designed software with loosely coupled tests which actually make sense even to the casual observer. Begin to refactor your code with ease as we step into a better paradigm for handling our React Native apps like a boss!<\/p>\n<p>We will discover :<\/p>\n<ul>\n<li>how to write cross platform code which can be used in React Native and React Web (or any other Single Page App for that matter)<\/li>\n<li>how to &lsquo;deal' with Redux and where it lives<\/li>\n<li>how YOU can use React so it doesn&rsquo;t USE you<\/li>\n<li>how to apply dependency management across architectural boundaries such as HTTP or the device specific storage<\/li>\n<li>and the elephant in the room&hellip; yes! you do need an Inversion Of Control container in JS apps!<\/li>\n<\/ul>",
        "country": "UK",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/13",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973204,
        "_created": 1538578071,
        "_id": "5bb4d6976531339bbe0003b1",
        "image": {
            "path": "images\/pete.png"
        },
        "title": "Building Scalable React Native Apps",
        "thumbnail": [],
        "order": 4,
        "event": "talk"
    },
    {
        "name": "Stephanie Nemeth",
        "bio": "",
        "company": "Frontend Dev @Werkspot and Co-organiser of the Stupid Hackathon Amsterdam",
        "talk": "<p>Wooed by the possibility to put LEDs on ALL THE THINGS and control them with an app, I bought my first (and second and third&hellip;) arduino this year and haven&rsquo;t looked back. But, as an IoT newbie, I defaulted to what I knew as a frontend developer. I applied the libraries I was familiar with from my daily work to solve my IoT problems with lackluster results. Things kind of worked, but the connections were flaky and it crashed a lot. It felt like there had to be something out there that was a better fit for communicating from the web to hardware. In my pursuit for a minimalist solution that could handle poor network connections and had implementations in C++ and JavaScript, I found the MQTT protocol.<\/p>\n<p>MQTT is a lightweight messaging architecture for sending data between hardware and other devices where a small code footprint and performance in poor network conditions are crucial. In this talk, we&rsquo;ll look what exactly what MQTT is, how I use it in my own art\/wearable project, and why you should check it out for your next hardware project.<\/p>",
        "country": "US \/ Netherlands",
        "twitter": "",
        "linkedin": "",
        "year": "",
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/9",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973196,
        "_created": 1538578185,
        "_id": "5bb4d7096531339c1b0003b7",
        "image": {
            "path": "images\/stephanie.png"
        },
        "title": " How to make your LEDs better listeners- Leveraging MQTT protocol to communicate with hardware from the web",
        "thumbnail": [],
        "order": 5,
        "event": "talk"
    },
    {
        "name": "Kevin Le Jeune",
        "bio": "",
        "company": "Software Engineer at Utility Warehouse",
        "talk": "<p>Kevin will be talking through the learning journey of our web and native partner portal application, looking at the pain points and learnings from that project lead us to developing the William SDK. Within this we talk about the application reusing as much code as possible to solve real business problems around constant UI\/ UX and branding as well as how we got around challenges like routing app\/ web and server communication with Rest API&rsquo;s and GraphQL.<\/p>",
        "country": "France",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/15",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973187,
        "_created": 1538578305,
        "_id": "5bb4d7816531339c840002c4",
        "image": {
            "path": "images\/kevin.png"
        },
        "title": "Building a JavaScript UI Framework SDK for Native Mobile and Web",
        "thumbnail": [],
        "order": 6,
        "event": "talk"
    },
    {
        "name": "Jonathan Fielding",
        "bio": "<p>Jonathan is a Engineering Manager at Beamly, where he focuses on building out and improving the site to offer users the best possible experience. The main drive behind anything that Jonathan does is whether it will benefit someone in some way, whether that be through improving UX on or through contributing to open source to help push the web forward. Outside of work, he has written Beginning Responsive Design with HTML5 and CSS3 and has worked on many open source projects including SimpleStateManager, Echo.js ResponsiveJavascript.com and Doccy. Aside from development he also has an awesome collection of geeky t-shirts.<\/p>",
        "company": "Engineering Manager @Beamly",
        "talk": "<p>As developers we make choices every day such as what framework to use, what tools to use and what browsers to support. All these decisions have a huge impact on both our experience as developers and the users experience when using out sites. Unfortunately these two areas are not aligned so lets have a look at how we can be pragmatic as developers taking into account both our users and developers experiences.<\/p>",
        "country": "UK",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/8",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973286,
        "_created": 1538578390,
        "_id": "5bb4d7d66531339cca000118",
        "image": {
            "path": "images\/jonathan.png"
        },
        "title": "How to make pragmatic choices around developer experience vs user experience",
        "thumbnail": [],
        "order": 7,
        "event": "talk"
    },
    {
        "name": "Mark Wubben",
        "bio": "",
        "company": "Dojo - AvaJS - IstanbulJS",
        "talk": "<p>ou know about the == operator, and the === operator too. They&rsquo;re great for comparing strings and numbers. But have you heard about Object.is()? Did you know it can give results different from ===? What&rsquo;s negative zero? Why is 0.1 + 0.2 not equal to 0.3? How do you go about comparing maps and objects and buffers and arrays?<\/p>\n<p>This talk goes into the nitty gritty of JavaScript value types and how to compare them.<\/p>\n<p>I&rsquo;ll cover value types in JavaScript:<\/p>\n<p>Primitives, e.g. numbers &amp; strings<\/p>\n<p>Objects, e.g. objects, but also arrays, sets, weak maps, typed arrays, etc<\/p>\n<p>Boxed types (Object(42))<\/p>\n<p>I&rsquo;ll cover how these values can be compared to each other through ==, === and Object.is(). I&rsquo;ll discuss the (legacy) quirks around typeof.<\/p>\n<p>I&rsquo;ll discuss how seemingly weird numbers are in JavaScript. It doesn&rsquo;t help that they&rsquo;re actually floats, resulting in 0.1 + 0.2 !== 0.3. I&rsquo;ll explain why Number.MAX_SAFE_INTEGER + 2 === Number.MAX_SAFE_INTEGER + 1. And why there is a negative zero, and why NaN !== NaN. There&rsquo;ll be a brief aside for the BigInt proposal and a quick reference of other proposals for fixing numbers.<\/p>\n<p>Finally I&rsquo;ll talk about deep value comparisons and why immutability is so important for building modern frontends.<\/p>",
        "country": "Netherlands",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/12",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973180,
        "_created": 1538578465,
        "_id": "5bb4d8216531339d0e000099",
        "image": {
            "path": "images\/mark.png"
        },
        "title": " Value Comparisons How Do I Even?",
        "thumbnail": [],
        "order": 8,
        "event": "talk"
    },
    {
        "name": "Alvin Ourrad",
        "bio": "",
        "company": "Functional Programmer @BBC, Cloud Architect, Learner, Speaker",
        "talk": "<p>The talk will start with a presentation of this new-fangled paradigm that we now see everywhere (it&rsquo;s used in Redux, React, Flux, inferno, you name it) and what makes is so useful and successful beyond the hype factor.<\/p>\n<p>Then, I show you how code written in the functional, unidirectional way differs from your traditional OOP version, and the pros and cons that come with it. During my exploration of this new style, I decided to go &ldquo;all-in&rdquo; and totally buy into other people&rsquo;s mindsets. I&rsquo;ll share with you the insights gathered during that process. It will then end with a short live coding demo.<\/p>",
        "country": "France",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/10",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973170,
        "_created": 1538578534,
        "_id": "5bb4d8666531339d4700038c",
        "image": {
            "path": "images\/AlvinO.png"
        },
        "title": " How I fell in love with unidirectional Data Flow and functional programming (+ WebGL demo)",
        "thumbnail": [],
        "order": 10,
        "event": "talk"
    },
    {
        "name": "Kadi Kraman",
        "bio": "",
        "company": "Software Engineer at Formidable Labs (@FormidableLabs)",
        "talk": "<p>GraphQL is quickly becoming an industry standard. For most use cases, querying data via a GraphQL graph rather than a RESTful API simple makes more sense. There are a whole host of tools available to build your GraphQL services. In fact, we are spoiled for choice! This talk goes over some GraphQL best practices and gives an opinionated view on how to first set up a GraphQL API with Apollo and Node.js and then query that API using a React frontend.<\/p>",
        "country": "Estonia",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/14",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973155,
        "_created": 1538578648,
        "_id": "5bb4d8d86531339da5000178",
        "image": {
            "path": "images\/kadi.png"
        },
        "title": "Getting started with Apollo GraphQL: an opinionated end to end journey with Node.js and React",
        "thumbnail": [],
        "order": 9,
        "event": "talk"
    },
    {
        "name": "Yan Cui",
        "bio": "",
        "company": "Functional Programmer, Cloud Architect, Learner, Speaker",
        "talk": "<p>The motivation of this talk is to provoke the audience to think about the failure modes that exists in their serverless architecture and how they can discover them early by applying the principles of chaos engineering.<\/p>\n<p>Serverless architectures have more inherent chaos and complexity than their serverful counterparts, and, we have less control over their runtime behaviour! For instance: * smaller unit of deployment, means there are more of them, and each of these &ldquo;units&rdquo; is a boundary that needs to be hardened (for security and failure resilience) * it&rsquo;s more difficult to harden around the boundaries simply because there are so many more of them * more intermediate services (dynamodb, kinesis, SNS, S3, API Gateway to name a few), each with their own failure modes * there are more configurations overall (timeout, IAM permissions, application config, etc.) therefore more opportunities for misconfiguration.<\/p>",
        "country": "",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/5",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973147,
        "_created": 1538578703,
        "_id": "5bb4d90f6531339dd200014d",
        "image": {
            "path": "images\/yan.png"
        },
        "title": "Applying principles of chaos engineering to Serverless",
        "thumbnail": [],
        "order": 10,
        "event": "talk"
    },
    {
        "name": "Lucas Fernandes da Costa",
        "bio": "",
        "company": "Software Engineer at Converge, Chai Core Team, Sinon maintainer",
        "talk": "<p>When writing JavaScript there are lots of details about how the language itself works most people don&rsquo;t see, such as what happens when you define or retrieve a property, when you use the new operator or when you invoke a function.<\/p>\n<p>In this talk we will dive deep into the language&rsquo;s inner workings and see how to improve performance, write cleaner and better APIs and create more extensible and adaptable programs by redefining operator&rsquo;s behaviors using things such as the new ES6 Proxy\/Reflect objects and many other features. By learning about meta programming you will not only be able to improve your code, you will be able to bend JavaScript to your will. Using meta programming techniques we are able to create powerful data structures and emulate some of other language&rsquo;s powerful features, such as Haskell&rsquo;s lazy properties and infinite sequences.<\/p>\n<p>Also, instead of only showing what you can do,I will show you how to do itand use real world examples to make it easier for everyone to apply these techniques in their job and personal projects as soon as possible. Learning meta programming is just like watching Sixth Sense for the first time: the perspective change blows your mind. Learning objectives:<\/p>\n<ul>\n<li>Meta Programming techniques in JavaScript<\/li>\n<li>Better understanding of how the language works behind the scenes<\/li>\n<li>How to take advantage of the Reflect\/Proxy\/Object\/Symbol APIs.<\/li>\n<\/ul>",
        "country": "Brasil",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/11",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973137,
        "_created": 1538578791,
        "_id": "5bb4d9676531339e1c000319",
        "image": {
            "path": "images\/lucas.png"
        },
        "title": "JavaScript Behind The Scenes - Meta Programming",
        "thumbnail": [],
        "order": 11,
        "event": "talk"
    },
    {
        "name": "Jo Francetti",
        "bio": "",
        "company": "Developer Advocate for samsung internet, Codebar",
        "talk": "<p>Introduction to Codebar<\/p>",
        "country": "UK",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/30",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973120,
        "_created": 1538578845,
        "_id": "5bb4d99d6531339e4c000223",
        "image": {
            "path": "images\/jo.png"
        },
        "title": "Introduction to Codebar",
        "thumbnail": [],
        "order": 12,
        "event": "talk"
    },
    {
        "name": "Gen Ashley",
        "bio": "",
        "company": "Founder of of TECH(K)NOW Day, Director of Women Who Code London, MVP",
        "talk": "<p>Introduction in Women Who Code<\/p>",
        "country": "UK",
        "twitter": "",
        "linkedin": "",
        "year": 2018,
        "videoUrl": "https:\/\/cityjsconf2018.streameventlive.com\/home\/video\/29",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1548973110,
        "_created": 1538578920,
        "_id": "5bb4d9e86531339ea900023b",
        "image": {
            "path": "images\/genashley.png"
        },
        "title": "Introduction in Women Who Code",
        "thumbnail": [],
        "order": 13,
        "event": "talk"
    },
    {
        "name": "Dylan Schiemann",
        "bio": "<p>As CEO of SitePen and co-founder of Dojo, Dylan Schiemann is an established presence in the JavaScript and open source communities.&nbsp;<\/p>",
        "company": "SitePen - Dojo",
        "title": "BTR FSTR AWSMR SSR - Building Apps with Dojo, A Progressive TypeScript Framework for Modern Web Apps",
        "talk": "<p>In a world where developer experience is often at odds with end user performance and experience, attempts to keep these conflicts at peace are evolving rapidly.<\/p>\n<p>This talk will look at some of the benefits and challenges with more common approaches to server-side rendering (SSR), and explore our team&rsquo;s journey into finding a better faster awesomer approach.<\/p>",
        "country": "United States",
        "twitter": "dylans",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=2cX_NSos11k&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=2&t=0s",
        "image": {
            "path": "images\/2019-speakers\/dylans.jpg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/dylan.jpg"
        },
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558439827,
        "_created": 1544095624,
        "_id": "5c090788653133337b000356",
        "order": 4,
        "event": "talk"
    },
    {
        "name": "Chris Heilmann",
        "bio": "<p>Chris Heilmann has dedicated a lot of his time making the web better. Originally coming from a radio journalism background, he built his first website from scratch around 1997 and spent the following years working on lots of large, international websites. He then spent a few years in Yahoo building products and explaining and training people including Yahoo Answers, Search, Local and Maps. He then worked at Mozilla moving HTML5 support forward and advocating Firefox OS as an open alternative to closed mobile systems. Chris wrote two and contributed to eight books on web development and wrote many articles and hundreds of blog posts for Ajaxian, Smashing Magazine, Yahoo, Mozilla, ScriptJunkie.Chris is currently working with the Microsoft Edge team as a Program Manager.<\/p>",
        "company": "Program Manager for Open Web and Browsers at Microsoft. Presenter, JavaScript lover.",
        "title": "<feTurbulence> && !important",
        "talk": "<p>Being a JavaScript developer is pretty messy. The frontend development world is in constant change and we don't even stop to analyse what we're doing any more. We build libraries to fix problems and keep using them although the problems are gone. We stifle creativity and innovation by telling people off for \"doing things wrong\". And we don't even consider understanding what others did before replacing it with the next new thing. Let's take a breather and stop chasing great ideas not very likely to ever be how we work. We need more people to work on interfaces. Let's concentrate on what matters.<\/p>",
        "country": "",
        "twitter": "codepo8",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=ImXgvzizM30&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=8&t=0s",
        "image": {
            "path": "images\/2019-speakers\/chrisheilmann.jpg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/chris.jpg"
        },
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558299920,
        "_created": 1544095793,
        "_id": "5c0908316531333402000377",
        "order": 2,
        "event": "talk"
    },
    {
        "name": "Srushtika Neelakantam",
        "bio": "",
        "company": "@ablyrealtime      TechSpeaker @mozilla ",
        "title": "The current state of the data sharing economy",
        "talk": "<p>In this talk, we'll see what real-time messaging and data streaming means, from the protocol level of applications. We'll also look at various open source tools to implement the real-time messaging architecture to stream data both within and outside of your applications and address the unforeseen challenges involved, with code examples in Node.js and JavaScript. In the end, we'll look the evolution of the data sharing economy, the various protocols, some standardised and some not, all of which you need to know to be at the top of your tech game.<\/p>",
        "country": "",
        "twitter": "Srushtika",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=0isukey1MYE&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=3&t=176s",
        "image": {
            "path": "images\/2019-speakers\/suthrika.jpg"
        },
        "thumbnail": {
            "path": "images\/Srushtika---Srushtika-Neelakantam.jpg"
        },
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300033,
        "_created": 1544096151,
        "_id": "5c090997653133353000030a",
        "order": 6,
        "event": "talk"
    },
    {
        "name": "Elle Haproff",
        "bio": "",
        "company": "JavaScript Engineer at @MarvelApp. ",
        "title": "Machine Learning with JavaScript & WORKSHOP - Machine learning with TensorFlow.js",
        "talk": "<p>JavaScript probably isn't the first language which springs to mind when you say 'machine learning', but that does seem to be changing, especially with the release of TensorFlow.js last year.<\/p>\n<p>&nbsp;<\/p>\n<p>This talk gives a high level overview of what machine learning and neural networks are, shows how to get started with TensorFlow.js, and demos a number of projects which use JavaScript and AI.<\/p>",
        "country": "",
        "twitter": "EleanorHaproff",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=Ii0o633QQIo&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=6&t=0s",
        "image": {
            "path": "images\/2019-speakers\/ellehaproff.jpg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/elle.jpg"
        },
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300109,
        "_created": 1544097244,
        "_id": "5c090ddc65313338d50002f4",
        "order": 3,
        "event": "both"
    },
    {
        "name": "Anthony Gubler",
        "bio": "",
        "company": "Dojo",
        "title": "",
        "talk": "",
        "country": "",
        "twitter": "",
        "linkedin": "",
        "year": "",
        "videoUrl": "",
        "image": [],
        "thumbnail": [],
        "order": "",
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1549023891,
        "_created": 1549023891,
        "_id": "5c543a93653133afc1000103"
    },
    {
        "name": "Matt Gadd",
        "bio": "",
        "company": "",
        "title": "",
        "talk": "",
        "country": "",
        "twitter": "",
        "linkedin": "",
        "year": "",
        "videoUrl": "",
        "image": [],
        "thumbnail": [],
        "order": "",
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1549023907,
        "_created": 1549023907,
        "_id": "5c543aa3653133afc1000288"
    },
    {
        "name": "Abi Travers",
        "bio": "",
        "company": "CompareTheMarket",
        "title": "Workshop - Machine learning with Tensorflow",
        "talk": "",
        "country": "",
        "twitter": "abi_travers_",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/2019-speakers\/lYlg6rxn_400x400.jpg"
        },
        "order": 10,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1550837755,
        "_created": 1549025028,
        "_id": "5c543f04653133b3cc00034f"
    },
    {
        "name": "James Milner",
        "bio": "",
        "company": "Sitepen - Google Developer Expert",
        "title": "Workshop - Building Apps with Dojo, A Progressive TypeScript Framework for Modern Web Apps",
        "talk": "",
        "country": "",
        "twitter": "",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/2019-speakers\/james.jpeg"
        },
        "order": 10,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1551008612,
        "_created": 1549282886,
        "_id": "5c582e46653133f59a000065"
    },
    {
        "name": "Benoit Simard",
        "bio": "",
        "company": "web developper @Neo4j",
        "title": "Workshop -  Full stack development with Neo4j: The GRAND stack (GraphQL, React, Apollo, Neo4j Database)",
        "talk": "",
        "country": "France",
        "twitter": "logisima",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/2019-speakers\/benoit.jpeg"
        },
        "order": 9,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1550837733,
        "_created": 1549535852,
        "_id": "5c5c0a6c6531338b8d0002c1"
    },
    {
        "name": "Luciano Mammino",
        "bio": "<p>Luciano was born in 1987, the same year Super Mario Bros was released in Europe, which, by chance is his favourite game! He started coding at the age of 12, hacking away with his father's old i386 armed only with MS-DOS and the QBasic interpreter and since then he has been professionally a software developer for more than 10 years.<\/p>\n<p>He is currently a Solution Architect at Vectra AI in Dublin where he is automating the hunt for cyberattackers. He loves the fullstack web, Node.js &amp; Serverless and co-authored \"Node.js design patterns\" (http:\/\/amzn.to\/1ZF279B), launched fstack.link and Serverlesslab.com<\/p>",
        "company": "Solution Architect at Vectra.ai",
        "title": "It’s about time to embrace Streams",
        "talk": "<p>In my experience with JavaScript\/Node.js devs I find out that Streams is a topic still mostly unexplored and sometimes even feared. This is probably one of the most beautiful features of Node.js and it can be adopted also in the browser.<\/p>\n<p>&nbsp;<\/p>\n<p>Once you grasp the fundamentals, you'll be able to solve some ordinary programming challenges in a much more elegant and efficient way, so this is a very interesting topic. In this talk, I will cover the following topics: Streams: when and how;<\/p>\n<p>&nbsp;<\/p>\n<p>Different types of streams; Built-in and custom streams; Composability; Stream utils; Streams in the browser.<\/p>",
        "country": "Ireland",
        "twitter": "loige",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=NMqO0JwEEQU&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=7&t=1s",
        "image": {
            "path": "images\/2019-speakers\/lucianomammino2.jpg"
        },
        "thumbnail": {
            "path": "images\/luciano.jpg"
        },
        "order": 5,
        "event": "talk",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300442,
        "_created": 1549923582,
        "_id": "5c61f4fe6531330ad00002e9"
    },
    {
        "name": "Sam Galson",
        "bio": "<p>Sam learned how to code at Founders and Coders after completing a PhD in History of Science. He worked on various projects for charities at Founders and Coders before joining YLD, where he has been consulting for two years, specialising in Node.js, React and Kubernetes.<\/p>",
        "company": "Software engineer at YLD",
        "title": "The Oracle at Delphi Neither Speaks nor Conceals",
        "talk": "<p>The \"exotic\" types of testing that interest me here (fuzz testing, generative testing, property-based testing, metamorphic testing and mutation testing) are not talked about much in the JS community. I believe that is not because they are known to be unhelpful, but rather because little is known about them at all.<\/p>\n<p>&nbsp;<\/p>\n<p>Libraries to enable these sorts of testing are still immature, but now reaching a point where it is possible for developers to try them out and come to their own opinions about the value of these testing approaches.<\/p>\n<p>&nbsp;<\/p>\n<p>My aim in this talk is therefore to educate about alternative testing methodologies and encourage the trialling of new tools so that the community can better gauge the value of the techniques they make possible.<\/p>",
        "country": "",
        "twitter": "sam_galson",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=x6zh3HRMl3U&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=4&t=0s",
        "image": {
            "path": "images\/2019-speakers\/samgalson.jpg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/sam.png"
        },
        "order": 4,
        "event": "talk",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300535,
        "_created": 1549924239,
        "_id": "5c61f78f6531330d4d00004c"
    },
    {
        "name": "Marquis de Geek",
        "bio": "<p>Steven Goodwin (London, England) has been involved in computing, science, and technology from an early age, building his first synthesizer while still in his teens. As a systems architect he's designed and built global systems for Unilever, Playfish, and Third Space Learning using a wide range of languages and technologies. He's also highly experienced on the small scale, with work on the iPhone, Arduino, and Raspberry Pi, as well as running teams of between 1 and 30 people. His position as an industry thought leader in technology implementations includes being a mentor at ed-invent, a start-up consultant, and a futurist. He has given talks around the world on topics as diverse as home automation, HTML5, game development, and quantum superpositions.<\/p>",
        "company": "Developer, maker, author, magician, musician, beer critic. ",
        "title": "Ada 99 - Rewriting the very first computer program. How does JavaScript stack up?",
        "talk": "<p>I've been developing in JavaScript for nearly 20 years and so am used to solving every problem with a JavaScript-shaped hammer. I don't think I'm alone in this, and wanted to break out of that mindset. Over my career I've professional developed in 16 different languages (and used a further 10 out of curiosity) so I set about re-writing the same code in each of those languages. The purpose of the exercise was (and is) to learn, re-learn, and refresh my memory of these programming languages.<\/p>\n<p>&nbsp;<\/p>\n<p>By focusing on the paradigms, syntax, data types, and structure of the code I was able to draw parallels between them and JavaScript which encourages me to think outside of the JavaScript-shaped box. This talk will take you on that journey of discovery highlighting many ideas you can take back into your own code, and well as giving an insight into many other languages you might not have seen. It will also make you thankful, or otherwise, by showing what you need to work through in other languages to achieve the same results as JavaScript.<\/p>",
        "country": "",
        "twitter": "marquisdegeek",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=6Q_PJk3lMx4&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=10&t=0s",
        "image": {
            "path": "images\/2019-speakers\/marquisdegeek2.jpg"
        },
        "thumbnail": {
            "path": "images\/marquisthegeek.png"
        },
        "order": 4,
        "event": "talk",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300619,
        "_created": 1549924635,
        "_id": "5c61f91b6531330ebd000354"
    },
    {
        "name": "Maya Shavin",
        "bio": "<p>I am currently Senior Frontend Developer @Cloudinary and also a writer on Frontend Weekly, where I mainly write articles about JavaScript tutorials and good practices. I have been developing web apps with Angular, VueJS and recently ReactJS. I love to learn and experiment with new framework, while believing that a strong Vanilla JavaScript knowledge is necessary for being a good web developer.<\/p>\n<p>When not coding, I enjoy traveling, reading manga, and sketching. My favorite Marvel character is Tony Stark, and yes, I know what I'm talking about.<\/p>",
        "company": "Senior Frontend Developer @Cloudinary ",
        "title": "Syntactic sugar - Diabetes alert & WORKSHOP - Optimize your eCommerce app stack with the JAMstack",
        "talk": "<p>JavaScript starting with ES6 offered a lot of new syntax and features. Most helps saving lines of code needs, while improves code readability and reduces the learning curve for the language.<\/p>\n<p>Yet usage of these syntax without considering consequences nor situation can bring the exact opposite result. In this session, we will discuss about these pitfalls, and how to develop more proactive coding habit .<\/p>",
        "country": "",
        "twitter": "MayaShavin",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=17XXubHZ7n4&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=4",
        "image": {
            "path": "images\/maya2.jpeg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/maya1.jpg"
        },
        "order": 7,
        "event": "talk",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1559231001,
        "_created": 1549924837,
        "_id": "5c61f9e56531330f83000085"
    },
    {
        "name": "Simona Cotin",
        "bio": "",
        "company": "Microsoft",
        "title": "MC of the event",
        "talk": "<p>For the second year in a row, Simona will be the Master of Ceremony for our conference.&nbsp;<\/p>\n<p>Simona is currently working for a Microsoft, as Developer advocate.<\/p>\n<p class=\"\">Between organizing meetups at AngularJS Dublin and now Javascript London, She also enjoys mentoring at communities like Women Who Code, ngGirls and codebar. I share my excitement for Angular and Azure at conferences in Europe and the US aiming to win the hearts and minds of developers.<\/p>\n<p class=\"\">I currently live in London, UK where I moved to from Dublin, Ireland. Before that, I spent some time in Geneva, Switzerland and most of my life in Romania - where I was born. Outside of work I am a foodie, with a preference for everything Italian.<\/p>",
        "country": "",
        "twitter": "simona_cotin",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": {
            "path": "images\/2019-speakers\/OSosNdqO_400x400.jpg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/OSosNdqO_400x400.jpg"
        },
        "order": 2,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300676,
        "_created": 1549983360,
        "_id": "5c62de80653133396c00039a"
    },
    {
        "name": "Trent Willis",
        "bio": "",
        "company": " Builder of Web Things Netflix",
        "title": "Creating Your Own Image Format in the Browser",
        "talk": "<p>The web platform features I&rsquo;ll cover in this talk (particularly Service Workers) are important topics in the JavaScript community for helping us build performant applications with great user experiences, but they also have some interesting characteristics that we can use to do things that previously weren&rsquo;t possible in JavaScript.<\/p>\n<p>This talk will encourage us to think about different ways we might be able to leverage these new features while giving a practical example with real code. So even if you are not interested in creating your own image format, you should walk away with some insights into the power and flexibility of the modern web platform.<\/p>",
        "country": "USA",
        "twitter": "trentmwillis",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=ZPxzpbnXiYc&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=9&t=0s",
        "image": {
            "path": "images\/2019-speakers\/trentwillis.jpg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/FnZRoFal_400x400.jpg"
        },
        "order": 1,
        "event": "talk",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558299700,
        "_created": 1550073671,
        "_id": "5c643f47653133f5c800017c"
    },
    {
        "name": " Maxime Beugnet ",
        "bio": "",
        "company": "Developer Advocate, MongoDB",
        "title": "Workshop -  Introduction to MongoDB Stitch - The MongoDB JavaScript Serverless Platform",
        "talk": "<p>An overview of MongoDB Atlas (PAAS) and MongoDB Stitch including a presentation of this serverless platform and all it's capabilities through a workshop session built to make you discover all the power of MongoDB. Maxime will present you MongoDB Atlas &amp; Stitch at the beginning to prepare you for the mini-application you will build on MongoDB Stitch and connect to your cluster hosted in MongoDB Atlas.<\/p>\n<p>Bring a laptop! All levels are welcome.<\/p>",
        "country": "",
        "twitter": "MBeugnet",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/2019-speakers\/maxime-beugnet-headshot.jpg"
        },
        "order": 11,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1556482130,
        "_created": 1550837024,
        "_id": "5c6fe52065313330f2000306"
    },
    {
        "name": "Ingrid Epure",
        "bio": "",
        "company": "Engineer Netlify",
        "title": "A web of infinite possibilities",
        "talk": "<p><span style=\"font-weight: 400;\">Once upon a time, you could do all sort of crazy things on the web like run Java programs, and build animations using Flash. There were no standards, so developers had to make different versions of every website they built so that they&rsquo;re compatible with the browsers at the time.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The web saw both a rise in creativity, and in really serious security vulnerabilities, as it became exponentially harder to develop for it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With the adoption of (much needed) web standards and the dotCom crash, the focus has shifted to stabilising and unifying the way we build, consume, and think about the web, and naturally some of the technologies died along the way being unable to keep up. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">The web as most of us know it today became variations of the same ideas and ways of building, with one language to rule the ecosystem : JavaScript. Some also argue that the web became &lsquo;serious,&rsquo; corporate, and a way to make money, to the detriment of creativity and innovation. <\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">But the idea of running other languages on the web was still in people&rsquo;s hearts, so a new glimmer of hope was born, and named WebAssembly or WASM. Simply put, WASM provides other languages like C++ and Rust a compilation target so that they can run on the web. All designed to nicely play alongside JavaScript. How exciting is that!?<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">In this talk, we will explore WASM as a way of bringing things that are not of the web, to the web. We will discuss how WebAssembly can open the web to even more engineers and creators, and boost<\/span><\/p>\n<p><span style=\"font-weight: 400;\">creativity and innovation in a secure and performant way.<\/span><\/p>",
        "country": "",
        "twitter": "@ingridepure",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "https:\/\/www.youtube.com\/watch?v=NwjpGQiphW0&list=PL8xuokhAnn4pv5CimOe9DnAGRosVkTF4r&index=11&t=2s",
        "image": {
            "path": "images\/2019-speakers\/ingrid.jpg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/Ingrid_Epure.png"
        },
        "order": 4,
        "event": "talk",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300180,
        "_created": 1552062037,
        "_id": "5c8296556531333c5c0002ff"
    },
    {
        "name": "Jani Eväkallio ",
        "bio": "",
        "company": "hosts smoosh.fun  • vp eng @formidablelabs",
        "title": "Smoosh x CityJSConf After Party Show",
        "talk": "<p data-v-5ebdd1ec=\"\">In collaboration with the infamous JavaScript comedy night #SMOOSH, CityJS Conf is proud to bring together some of London's funniest developers to make you laugh and cry (tears of joy, hopefully)<\/p>",
        "country": "",
        "twitter": "jevakallio",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": {
            "path": "images\/2019-speakers\/jani.jpeg"
        },
        "thumbnail": {
            "path": "images\/2019-speakers\/jani.jpeg"
        },
        "order": 3,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300773,
        "_created": 1553086282,
        "_id": "5c92374a653133e6d00001bf"
    },
    {
        "name": "Joe Hart",
        "bio": "",
        "company": "React Engineer\/Comedian",
        "title": "Smoosh x CityJSConf After Party Show",
        "talk": "<p>In collaboration with the infamous JavaScript comedy night #SMOOSH, CityJS Conf is proud to bring together some of London's funniest developers to make you laugh and cry (tears of joy, hopefully)<\/p>",
        "country": "",
        "twitter": "joehart",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/2019-speakers\/joe.jpg"
        },
        "order": 10,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1558300754,
        "_created": 1553086601,
        "_id": "5c923889653133e838000389"
    },
    {
        "name": "TC Thirty-NaN ",
        "bio": "",
        "company": "",
        "title": "Smoosh x CityJSConf After Party Show",
        "talk": "<p>In collaboration with the infamous JavaScript comedy night #SMOOSH, CityJS Conf is proud to bring together some of London's funniest developers to make you laugh and cry (tears of joy, hopefully)<\/p>",
        "country": "",
        "twitter": "",
        "linkedin": "",
        "year": "",
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/2019-speakers\/TC39_NAN.png"
        },
        "order": 15,
        "event": "talk",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1553087806,
        "_created": 1553087345,
        "_id": "5c923b71653133eb6d000095"
    },
    {
        "name": "Hew Ingram",
        "bio": "",
        "company": "Software Engineer at Applied",
        "title": "Workshop - Build your own Serverless tic tac toe AI using Node.js and (a little bit of) TensorFlow.js",
        "talk": "<p dir=\"ltr\">Explore how Node.JS and serverless applications is going to power the next generation of websites with Hew and Thomas. In this workshop you will be introduced to backend development and some basic machine learning through building your own Tic Tac Toe service utilising serverless technology and <a href=\"https:\/\/www.tensorflow.org\/js\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.tensorflow.org\/js&amp;source=gmail&amp;ust=1553253849942000&amp;usg=AFQjCNFTw_nnYaTjC8HqeaOjdFBuq4cmnw\">TensorFlow.js<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">The workshop is 2 hours 30 minutes long and you will learn to:<\/p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Learn about what serverless means and why it&rsquo;s <img class=\"CToWUd\" src=\"https:\/\/mail.google.com\/mail\/e\/1f389\" alt=\"🎉\" data-goomoji=\"1f389\" data-image-whitelisted=\"\" \/>awesome <img class=\"CToWUd\" src=\"https:\/\/mail.google.com\/mail\/e\/1f389\" alt=\"🎉\" data-goomoji=\"1f389\" data-image-whitelisted=\"\" \/><\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Create and deploy a serverless function<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Build a simple <a href=\"https:\/\/en.wikipedia.org\/wiki\/Artificial_neural_network\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/en.wikipedia.org\/wiki\/Artificial_neural_network&amp;source=gmail&amp;ust=1553253849942000&amp;usg=AFQjCNG-rXPnvZZMF_tVuoTYJDaVV9B6nw\">neural network<\/a> using tensorflow.js<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Integrate this with a <a href=\"https:\/\/vuejs.org\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/vuejs.org\/&amp;source=gmail&amp;ust=1553253849942000&amp;usg=AFQjCNF4rYL2Y2S41XMASJC4gITRzyY5EQ\">Vue.JS<\/a> Tic Tac Toe App<\/p>\n<\/li>\n<\/ul>",
        "country": "",
        "twitter": "hewingram",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/2019-speakers\/HewIngram.jpg"
        },
        "order": 20,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1553169885,
        "_created": 1553167696,
        "_id": "5c937550653133456400032c"
    },
    {
        "name": "Thomas Ankcorn",
        "bio": "",
        "company": "Lead Developer at BAE Systems",
        "title": "Workshop: Build your own Serverless tic tac toe AI using Node.js and (a little bit of) TensorFlow.js",
        "talk": "<p dir=\"ltr\">Explore how Node.JS and serverless applications is going to power the next generation of websites with Hew and Thomas. In this workshop you will be introduced to backend development and some basic machine learning through building your own Tic Tac Toe service utilising serverless technology and&nbsp;<a href=\"https:\/\/www.tensorflow.org\/js\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.tensorflow.org\/js&amp;source=gmail&amp;ust=1553253849942000&amp;usg=AFQjCNFTw_nnYaTjC8HqeaOjdFBuq4cmnw\">TensorFlow.js<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<p dir=\"ltr\">The workshop is 2 hours 30 minutes long and you will learn to:<\/p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Learn about what serverless means and why it&rsquo;s&nbsp;<img class=\"CToWUd\" src=\"https:\/\/mail.google.com\/mail\/e\/1f389\" alt=\"🎉\" data-goomoji=\"1f389\" data-image-whitelisted=\"\" \/>awesome&nbsp;<img class=\"CToWUd\" src=\"https:\/\/mail.google.com\/mail\/e\/1f389\" alt=\"🎉\" data-goomoji=\"1f389\" data-image-whitelisted=\"\" \/><\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Create and deploy a serverless function<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Build a simple&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Artificial_neural_network\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/en.wikipedia.org\/wiki\/Artificial_neural_network&amp;source=gmail&amp;ust=1553253849942000&amp;usg=AFQjCNG-rXPnvZZMF_tVuoTYJDaVV9B6nw\">neural network<\/a>&nbsp;using tensorflow.js<\/p>\n<\/li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Integrate this with a&nbsp;<a href=\"https:\/\/vuejs.org\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/vuejs.org\/&amp;source=gmail&amp;ust=1553253849942000&amp;usg=AFQjCNF4rYL2Y2S41XMASJC4gITRzyY5EQ\">Vue.JS<\/a>&nbsp;Tic Tac Toe App<\/p>\n<\/li>\n<\/ul>",
        "country": "United Kingdom",
        "twitter": "thomasankcorn",
        "linkedin": "",
        "year": 2019,
        "videoUrl": "",
        "image": [],
        "thumbnail": {
            "path": "images\/ThomasAnkcorn.jpg"
        },
        "order": 15,
        "event": "workshop",
        "_mby": "5ba3ca7b6531330bbd0003ca",
        "_by": "5ba3ca7b6531330bbd0003ca",
        "_modified": 1553169914,
        "_created": 1553167838,
        "_id": "5c9375de65313346150000c2"
    }
]